<template>
    <div class="getkey">
        账号和获取密钥 <br>
        更新时间：2022年08月07日 <br>
        使用方法 <br>
        1
        注册百度账号 <br>
        2
        申请成为百度开发者 <br>
        3
        获取服务密钥（AK） <br>
        4
        使用相关服务功能 <br>
        账号注册 <br>
        1.进入百度地图开放平台官网，点击右上角【登录】按钮，进入百度账号登录页面 <br>

        %E6%B3%A8%E5%86%8C1.jpg <br>

        2.如您已经拥有百度账号，请通过扫码/用户名验证的方式直接登录；如您还未拥有百度账号请您点击【注册】完成账号注册 <br>

        %E6%B3%A8%E5%86%8C2.png <br>

        3.通过百度账号注册成为百度地图开放平台开发者，选择开发者类型（个人/企业），完成开发者认证即可 <br>

        %E6%B3%A8%E5%86%8C3.png <br>

        AK秘钥申请 <br>
        JavaScript API只支持浏览端的AK进行接入与访问，请开发者在申请AK时注意选择正确的AK类型。 <br>

        1.进入百度地图开放平台官网控制台，点击【应用管理】-【我的应用】 <br>

        %E6%B3%A8%E5%86%8C4.png <br>

        2.点击【创建应用】进入AK申请页面，填写应用名称，务必选择AK类型为“浏览器端”，JS API只支持浏览器端AK进行请求与访问 <br>

        %20%E6%B3%A8%E5%86%8C5.png <br>

        3.为了防止您的AK被盗用，请您务必配置refer白名单，只有该白名单中的网站才能成功发起调用。如下方示例所示，配置了*.mysite.com*为域名白名单，即代表域名中包含.mysite.com的网站=才可以使用该AK访问JS API的服务 <br>

        %E6%B3%A8%E5%86%8C6.png <br>

        服务配额 <br>
        请您务必先申请密钥（AK）再使用JS API提供的相关服务，接口无使用次数限制，请开发者放心使用。 <br>
        如有问题请随时通过工单系统联系我们。 <br>
    </div>
</template>
<script setup lang="ts">
</script>